Tekla Open API Reference for Tekla Structures 2025
Distance.ToString Method (String)
 Creates a string representation of the distance.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ToString(
	string format
)
Public Function ToString (
	format As String
) As String
Parameters
format
Type: System.String
The format string.
Return Value
Type: String
The string representation of the distance.
Examples
 This example shows how to specify a number format when converting a Distance instance to a string.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           // For this demonstration, we'll format 300.2 millimeters.
           Distance distance = new Distance(300.2);
           // We can use the number format string to specify the precision. In this case, we use two decimal places.
           string formattedString = distance.ToString("0.00");
       }
}
See Also
Reference
Distance Structure
ToString Overload
Tekla.Structures.Datatype Namespace